#输入一个字符串，用*填充至30位，居中
s = input()
print("{:*^30}".format(s))#首先必不可少的":"，其次用"*"连接，最后加上"^"表示居中

#输入一个数字，用@填充至30位，居右，带千位分隔符
n = eval(input("请输入一个数字"))
print("{:@>30,}".format(n))#首先必不可少的":"，其次用"*"连接，最后加上">"表示居右,加上","表示千位分隔

#保留两位小数
a = 3.1415926
print("{:.2f}".format(a))#.xf，x为要保留至小数点后几位

#输入一个9800~9811的正整数，作为Unicode编码，把n-1，n，n+1这三个对应的Unicode值居中输出，其余用+填充至11位
n = eval(input("请输入一个数字"))
print("{:+^11}".format(chr(n-1)+chr(n)+chr(n+1)))#首先必不可少的":"，其次用"+"连接，最后加上"^"表示居中,用11位表示位数\

# 将s装换为2进制数
s = input()
num = int(s)
print("二进制数为:{:b}".format(num))